let u = require('../common/util.js');
let statusMap = {
  '3030': '发布超过30天：发新帖',
  '3070': '7天内超过4次:重新编辑',
  '3100': '免费刷新用完：不管',
  '3404': '个人删除',
  '3401': '需返回修改',
  '3500': '订单异常',
  '3501': '审核不通过',
  '3502': '刷新成功',
  '3503': '刷新失败',
  '3504': '订单不存在',
  '3505': '编辑帖子成功',
  '3506': '编辑帖子失败',
  '3507': '编辑帖子异常',
  '3510': '发布帖子成功',
  '3511': '发布帖子失败',
  '3512': '发布帖子异常',
  '3513': '发帖权限已用尽',
  '3514': '本月还可免费发帖',
  '3521': 'js发帖未处理异常',
  '3522': 'js发帖正常',
  '3523': '租金为空',
  '3524': '电话校验回填验证码',
  '3525': '上传的图片小于5K',
  '2000': '账户正常',
  '4000': '密码错',
  '4001': '未实名认证',
  '4002': '认证超时',
  '4003': '用户名不存在',
  '4004': '账户异常',
  '4005': '账户需要设置cookie',
  '4006': '用户名密码不匹配',
};
(async () => {
  let sql = `SELECT
              *
            FROM
              log
            WHERE
              create_date = '2019-07-06'`;
  let list = await u.execSql(0, sql)
  list = list.map(item => {
    let info = JSON.parse(JSON.stringify(item));
    info.statusStr = statusMap[info.status]
    return info;
  });
  console.log(list);
})();
